Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་ཞི་བའི་རང་བཞིན་ལ་མངོན་པར་དགའ་བའི་ལྟ་བ་ཕུན་སུམ་ཚོགས་པར་ཡང་འགྱུར་རོ། །
en: They will perfect the view of great joy in the Tathāgata’s tranquil nature.

source: དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའོ། །ཞེས་རྣམ་པ་ཐམས་ཅད་དུ་ལྟ་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཡང་འགྱུར་རོ། །
en: They will become oceans of the views of all the aspects of the Tathāgata, saying that the Tathāgata is permanent, eternal, constant, and tranquil.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཆོས་ཀྱི་སྐུ་ཡིན་ནོ་ཞེས་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will see the reality that the Tathāgata’s body is the Dharma body.

source: དེ་བཞིན་གཤེགས་པའི་རྡོ་རྗེའི་སྐུ་ནི་མི་ཕྱེད་པའི་སྐུ་ཡིན་ནོ་ཞེས་ཡང་དག་པ་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will see the truth that the Tathāgata’s vajra body is an immutable body.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་རུས་པ་མ་ཡིན་ཞིང་ཤ་མ་ཡིན་ལ་ཁྲག་མ་ཡིན་ཏེ། རྒྱུས་པ་མ་ཡིན་ནོ་ཞེས་སྟོང་པ་ཉིད་དུ་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will profess emptiness, stating that the Tathāgata’s body is not a body of bone, flesh, blood, or muscle.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་ནི་འབྲས་བུ་ཡོད་པ་ཡིན་ནོ། །ཞེས་འབྲས་བུ་ཡོད་པར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will profess the existence of fruition, stating that in the Tathāgata’s Dharma teachings, the fruition is existent.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་ལ་ནི་འབྲས་བུ་མེད་པར་ཡང་འགྱུར་བ་མེད་དོ་ཞེས་མེད་པར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will profess nonexistence, stating that in the Tathāgata’s Dharma teachings, the extinction of fruition is nonexistent.

source: དེ་བཞིན་གཤེགས་པ་ལ་ནི་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བ་མེད་དོ་ཞེས་གསལ་བར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will profess clarity, stating that the Tathāgata never enters into parinirvāṇa.

source: དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཚུལ་ཁྲིམས་ཉམས་པ་མེད་དོ་ཞེས་ཚུལ་ཁྲིམས་ཀྱི་བསྔགས་པ་བརྗོད་པར་ཡང་འགྱུར་རོ། །
en: “They will praise discipline, saying that all sentient beings who follow the Tathāgata in going forth to renunciation have uncorrupted discipline.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ནི་ནུབ་པར་འགྱུར་བ་མེད་དོ་ཞེས་ནུབ་པར་མི་འགྱུར་བའི་བསྔགས་པ་བརྗོད་པར་ཡང་འགྱུར་རོ། །
en: They will praise nondeclining, saying that the Tathāgata’s Dharma teachings will not decline.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་དང་རྒྱུད་དག་ཅིང་ཡོངས་སུ་དག་ལ་དྲི་མ་མེད་པས་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐབས་ཀྱི་རིགས་ཀྱི་རྒྱུད་ཡིན་ནོ་ཞེས་ལྟ་བ་ཕུན་སུམ་ཚོགས་པར་ཡང་འགྱུར་རོ། །
en: They will perfect the view that because there are no stains in the Tathāgata’s thoroughly pure family and lineage, bodhisattvas belong to the family lineage of skillful means.

source: རྟག་ཏུ་འཁོར་བ་ལ་སྡུག་པར་སེམས་པར་ཡང་འགྱུར་རོ། །
en: They will think happily of remaining permanently within cyclic existence.

source: འཁོར་བའི་བསྔགས་པ་བརྗོད་པར་ཡང་འགྱུར་རོ། །
en: They will praise cyclic existence.

source: འཁོར་བའི་ཆེད་དུ་ཐོས་པའི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །
en: They will become oceans of learning to cycle within existence.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་དམིགས་པར་འདོད་པར་ཡང་འགྱུར་རོ། །
en: They will desire to perceive the tathāgata family.

source: རྟག་ཏུ་ཉོན་མོངས་པ་ལ་སེམས་པར་ཡང་འགྱུར་རོ། །
en: They will think of being forever afflicted.

source: ཉོན་མོངས་པ་ལ་སྡུག་པར་སེམས་པར་ཡང་འགྱུར་རོ། །
en: They will think happily of being afflicted.

source: ཉོན་མོངས་པའི་སྒོ་རྣམ་པ་སྣ་ཚོགས་འཐོབ་པ་ལ་དད་པ་ཐོབ་པར་ཡང་འགྱུར་རོ། །
en: They will gain faith in obtaining the various gateways to the afflictions.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཕྲིན་ལས་ཀྱི་ཞིང་ལ་སྨོན་ལམ་འདེབས་པའི་སེམས་སུ་ཡང་འགྱུར་རོ། །
en: They will establish in their minds the aspiration toward the field of all the buddhas’ activities.

source: ལས་ཐམས་ཅད་ཀྱི་རྩ་བ་ནི་ཉོན་མོངས་པ་ཡིན་ནོ་ཞེས་རྙེད་པ་ལེགས་པར་རྙེད་པར་ལྟ་བར་ཡང་འགྱུར་རོ། །
en: They will see and properly reach the discovery that the root of all karmic activity is affliction.

source: སངས་རྒྱས་ཀྱི་རྟག་པ་ཉིད་ལ་ཡང་སོམ་ཉི་མི་ཟ་ཞིང་ཡིད་གཉིས་མེད་ལ་ཐེ་ཙོམ་ཟ་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not be skeptical or ambivalent or entertain doubts about the Buddha’s permanence.

source: འཁོར་བ་ལ་མངོན་པར་དགའ་བར་ཡང་འགྱུར་རོ། །
en: They will manifest joy toward cyclic existence.

source: འཁོར་བ་ལ་མོས་པར་ཡང་འགྱུར་རོ། །
en: They will turn toward cyclic existence.

source: བདག་སངས་རྒྱས་སུ་འགྱུར་བར་བྱའོ་ཞེས་རྟག་ཏུ་དད་པའི་སེམས་སུ་ཡང་འགྱུར་རོ། །
en: Their minds will always have the faith that they will become a buddha.

source: བདག་གིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱའོ། །བདག་གིས་སེམས་ཅན་རྣམས་དགྲོལ་བར་བྱའོ། །བདག་གིས་སངས་རྒྱས་ཀྱི་གདུང་མི་གཅད་པར་བྱའོ་ཞེས་དམ་འཆའ་ཞིང་སྨོན་ལམ་འདེབས་ཏེ།
en: “They will become bodhisattvas, captains, who make the commitment and aspiration, ‘I will turn the wheel of Dharma. I will liberate all sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་དུ་ཡང་འགྱུར་རོ། །
en: I will not cut off ties with my buddha heritage.’

source: བདུད་ཀྱི་སྨན་པར་ཡང་འགྱུར་རོ། །
en: They will become doctors curing the māras.

source: འཁོར་བའི་ཉོན་མོངས་པའི་རྒྱ་མཚོའི་སྟོན་པ་བོར་ཡང་འགྱུར་རོ། །
en: They will become teachers in the ocean of afflictions of cyclic existence.

source: འཁོར་བའི་ཉོན་མོངས་པའི་ཚོང་རྡལ་འཐོབ་པར་ལྟ་བར་ཡང་འགྱུར་རོ། །
en: They will envision reaching the trading town of the afflictions of cyclic existence.

source: འཁོར་བའི་རྒྱ་མཚོ་ཆེན་པོ་འཐོབ་པས་སྐོམ་པར་ཡང་འགྱུར་རོ། །
en: They will quench their thirst by obtaining the great ocean of cyclic existence.

source: འཁོར་བ་ལ་སྲེད་པར་ཡང་འགྱུར་རོ། །
en: They will thirst for cyclic existence.

source: འཁོར་བ་འཐོབ་པ་ལ་རག་ལས་པའི་སེམས་སུ་ཡང་འགྱུར་རོ། །
en: Their minds will depend upon obtaining cyclic existence.

source: འཁོར་བ་འཐོབ་པ་མི་གཏོང་བར་ཡང་འགྱུར་རོ། །
en: They will not give up the attainment of cyclic existence.

source: འཁོར་བའི་ཆུ་ལ་པད་མའི་རྒྱལ་པོ་རྒྱས་པར་ཡང་འགྱུར་རོ། །
en: They will blossom as kingly lotus flowers in the waters of cyclic existence.

source: འཁོར་བའི་ཉོན་མོངས་པའི་རྒྱ་མཚོའི་གཞིར་ཡང་འགྱུར་རོ། །
en: They will become solid ground amid the oceans of cyclic existence.

source: འཁོར་བའི་ཉོན་མོངས་པ་ལ་རྟག་ཏུ་སྨོན་ལམ་འདེབས་པའི་སེམས་སུ་ཡང་འགྱུར་རོ། །
en: They will constantly establish in their minds aspirations targeting the afflictions of cyclic existence.

source: སེམས་ཅན་དམྱལ་བའི་འགྲོ་བ་ལ་དགའ་བར་ཡང་འགྱུར་རོ། །
en: “They will delight in going into the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་འགྲོ་བ་ལ་སེམས་ཤིང་རྟག་ཏུ་བསམ་པ་གཏོད་པའི་ངང་ཚུལ་ཅན་དུ་ཡང་འགྱུར་རོ། །
en: They will think of going to the hell realms and will conduct themselves by always aiming their thoughts toward going to the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་ཚོང་རྡལ་གྱི་ཚོང་པར་ཡང་འགྱུར་རོ། །
en: They will become merchants in the trading town of the hell realms.

source: སེམས་ཅན་དམྱལ་བ་ཐོབ་པ་མི་གཏོང་བར་ཡང་འགྱུར་རོ། །
en: They will not give up the attainment of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་མེ་ལ་སེམས་རྒྱས་པར་ཡང་འགྱུར་རོ། །
en: They will extensively contemplate the fires of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་ཉོན་མོངས་པས་སྙོན་རྨོངས་པར་གྱུར་པ་རྣམས་ལ་བདེ་ཞིང་བསིལ་བའི་རླུང་དུ་ཡང་འགྱུར་རོ། །
en: They will become a pleasing, cooling wind for those beings who have become afflicted by the afflictions of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་མེ་དྲག་པོ་ལ་སྤྲིན་ཆེན་པོ་ལས་ཆར་ཀུན་ཏུ་འབེབས་པར་ཡང་འགྱུར་རོ། །
en: They will become a shower of rainfall from the great cloud, which falls upon the fierce fires of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་ཐོག་ཏོག་ཏུ་ཡང་འགྱུར་རོ། །
en: They will become hailstorms#14 within the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་སྟོན་པ་པོར་ཡང་འགྱུར་རོ། །
en: They will become teachers of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་རྒྱ་མཚོའི་མཉན་པ་ཆེན་པོར་ཡང་འགྱུར་རོ། །
en: They will become great ferrymen in the ocean of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་སྨན་པར་ཡང་འགྱུར་རོ། །
en: They will become doctors of the hell realms.

source: སེམས་ཅན་དམྱལ་བའི་ཟས་སུ་ཡང་འགྱུར་རོ། །
en: They will become sustenance in the hell realms.

source: འཁོར་བའི་སྡུག་བསྔལ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཟིན་པའི་མུན་པ་མུན་གནག་བསལ་བའི་ཕྱིར་སྒྲོན་མ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: “They will become like torches because they dispel the thick darkness of those who are seized by all the sufferings and afflictions of cyclic existence.

source: སྣང་བར་བྱ་བའི་ཕྱིར་མར་མེ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like oil lamps because they shine light.

source: སྲིད་པའི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་མྱུར་དུ་གདུག་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གོས་པར་མི་འགྱུར་བའི་ཕྱིར་བར་སྣང་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like open space because they can never be obscured by the various fast-acting and malevolent afflictions of beings within cyclic existence.

source: སེམས་ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་མི་གནས་པར་ཡང་འགྱུར་རོ། །
en: They will not abide anywhere, because their minds will be equal to space.

source: དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་སྟེ། ཚུལ་ཁྲིམས་དང་། སྟོབས་དང་ཡེ་ཤེས་དང་ལྡན་པའི་ཕྱིར་ཁ་བའི་ཕུང་པོ་ལྟ་བུའི་ཉོན་མོངས་པ་སེལ་བའི་ཉི་མ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the sun clearing away afflictions as if melting a snowbank, because they have followed the Tathāgata in going forth to renunciation and because they possess discipline, strength, and gnosis.

source: ལེགས་པར་སྨྲས་པ་ཡང་དག་པར་བླང་བའི་ཕྱིར་གཞན་གྱི་དྲིང་མི་འཇོག་པར་ཡང་འགྱུར་རོ། །
en: They will not posit the ways of other schools, because they have correctly adopted the most excellent position.

source: ཡེ་ཤེས་རྒྱ་མཚོ་དང་ལྡན་པའི་ཕྱིར་རྒྱ་མཚོ་དུག་ཅན་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the ocean because they possess oceans of gnosis.

source: དཀར་པོའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the moon because they have thoroughly perfected positive qualities.

source: གཏི་མུག་གི་མུན་པ་སེལ་བའི་ཕྱིར་ཉི་མ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the sun because they dispel the darkness of ignorance.

source: ཉོན་མོངས་པས་འཁོར་བ་ལ་མངོན་པར་འཇུག་ཅིང་འགྲོ་བའི་ཚེ་བར་སྣང་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like open space when, by means of the afflictions, they enter and migrate within cyclic existence.

source: དེ་དང་དེ་མངོན་པར་རྟོགས་པས་པད་མ་ལྟ་བུར་གོས་པ་མེད་པར་ཡང་འགྱུར་རོ། །
en: They will become unsullied like lotus flowers by manifesting various realizations.

source: ཆོས་ཐམས་ཅད་ལ་ངེས་པར་འབིགས་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: “They will become like vajras because they will pierce through all phenomena.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་ཐོས་ན་མི་གཡོ་བའི་ཕྱིར་རི་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like mountains because they will not waver when hearing of the permanent, eternal, constant greatness of the Tathāgata’s virtuous qualities.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་དང་རྒྱུད་ལ་ཡེ་ཤེས་རྣམ་པར་དག་པའི་ཕྱིར་བཻ་དཱུརྱ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like beryl because the gnosis of the family and lineage of the tathāgatas is completely pure.

source: ཉོན་མོངས་པའི་རྙོག་པ་སེལ་བའི་ཕྱིར་རྒྱ་མཚོ་དུག་ཅན་པའི་གསེར་གྱི་ཕ་བོང་ལྟ་བུར་ཡང་འགྱུར་རོ།
en: They will become like golden boulders within the ocean because they clear away the turbidity of the afflictions.

source: དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པའི་རང་བཞིན་མཐོང་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like the moon, having seen the permanent, eternal, constant nature of the Tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ལས་མི་གཡོ་བའི་ཕྱིར་རི་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like mountains because they will not waver from the Tathāgata’s Dharma.

source: དེ་བཞིན་གཤེགས་པ་གཏན་དུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་ཆོས་ནུབ་པར་མི་འགྱུར་བ་ཐོས་ནས་མི་གཡོ་བའི་ཕྱིར་སྒོའི་ཐེམ་པ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like door frames because they will not waver when they hear that the Tathāgata does not pass into parinirvāṇa and that the Dharma will not disappear.

source: ཡང་དག་པ་མཐོང་བའི་ཕྱིར་སེམས་བརྟན་ཞིང་གནས་པར་ཡང་འགྱུར་རོ། །
en: Their minds will abide steadily because they will see what is truly so.

source: སེམས་མི་ཕྱེད་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like vajras because their minds will be immutable.

source: མངོན་སུམ་དུ་ཡོན་ཏན་མང་པོ་འཐོབ་པ་མང་བར་ཡང་འགྱུར་རོ། །
en: “They will amply obtain an abundance of conspicuous qualities.

source: ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པ་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become endowed with a sense of shame and modesty.

source: མཛེས་པར་ཡང་འགྱུར་རོ། །
en: They will become beautiful.

source: བལྟ་ན་སྡུག་པར་ཡང་འགྱུར་རོ། །
en: They will become pleasing to behold.

source: བརྐམ་པ་མེད་པར་ཡང་འགྱུར་རོ། །
en: They will become free from craving.

source: ལུས་ཆུང་ངུར་ཡང་མི་འགྱུར་རོ། །
en: Their bodies will not be weak.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become endowed with the most excellent complexion.

source: རིགས་མཐོན་པོར་སྐྱེ་བར་ཡང་འགྱུར་རོ། །
en: They will be born within noble families.

source: རིགས་ཆེན་པོར་སྐྱེ་བར་ཡང་འགྱུར་རོ། །
en: They will be born within great families.

source: འཁོར་མང་བར་ཡང་འགྱུར་རོ། །
en: They will have great retinues.

source: འཁོར་མི་ཕྱེད་པར་ཡང་འགྱུར་རོ། །
en: Their retinues will not decline.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་མི་ཉམས་ཤིང་ཡོངས་སུ་ཉམས་པར་ཡང་མི་འགྱུར་རོ། །
en: They will not backslide and will never backslide from unsurpassed, complete, and perfect awakening.

source: ཁ་ཟས་ལ་བརྐམ་པར་ཡང་མི་འགྱུར་རོ། །
en: They will not have craving for food.

source: ཤའི་ཁ་ཟས་ཀྱང་རྣམ་པར་སྤོང་བར་ཡང་འགྱུར་རོ། །
en: They will completely abandon foods containing meat.

source: བློ་གྲོས་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become intelligent.

source: སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་ཞིང་ཆེར་བཀུར་བར་ཡང་འགྱུར་རོ། །
en: They will become charming toward all beings and well respected by them.

source: དྲན་པ་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become mindful.

source: གཟི་བྱིན་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become charismatic.

source: ཤེས་རབ་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become wise.

source: དགའ་བ་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become joyful.

source: འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་ཡང་འགྱུར་རོ། །
en: “They will act in harmony with the world.

source: འཇིག་རྟེན་ལ་ཕན་པར་འདོད་པར་ཡང་འགྱུར་རོ། །
en: They will desire to benefit the world.

source: འཇིག་རྟེན་ལ་བདེ་བར་ཡང་འགྱུར་རོ། །
en: They will take pleasure in the world.

source: འཇིག་རྟེན་གྱི་ཐུ་བོར་ཡང་འགྱུར་རོ། །
en: They will become prominent within the world.

source: འཇིག་རྟེན་གྱི་གཙོ་བོར་ཡང་འགྱུར་རོ། །
en: They will become leaders of the world.

source: འཇིག་རྟེན་གྱི་མཆོག་ཏུ་ཡང་འགྱུར་རོ། །
en: They will become supreme within the world.

source: འཇིག་རྟེན་གྱི་རབ་ཏུ་ཡང་འགྱུར་རོ། །
en: They will become foremost in the world.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བར་འོས་པར་ཡང་འགྱུར་རོ། །
en: They will become worthy of receiving homage from all worlds.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོད་པའི་གནས་སུ་ཡང་འགྱུར་རོ། །
en: They will become recipients of offerings from all worlds.

source: སྦྱིན་བདག་ཆེན་པོར་ཡང་འགྱུར་རོ། །
en: “They will become great donors.

source: སྟོབས་ཆེན་པོ་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become strong.

source: དཔའ་བོ་ཆེན་པོར་ཡང་འགྱུར་རོ། །
en: They will become great heroes.

source: བརྩོན་འགྲུས་ཆེན་པོ་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become resolute.

source: བྱམས་པའི་སེམས་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: Their minds will become loving and kind.

source: བདེན་པར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will speak the truth.

source: བརྟུལ་ཞུགས་བརྟན་པར་ཡང་འགྱུར་རོ། །
en: They will become steadfast in their ascetic practice.

source: བརྩོན་འགྲུས་བརྩམས་པར་ཡང་འགྱུར་རོ། །
en: They will exercise their resolve.

source: བྱམས་པ་ལ་གནས་པར་ཡང་འགྱུར་རོ། །
en: They will abide by loving-kindness.

source: སྙིང་རྗེ་ལ་གནས་པར་ཡང་འགྱུར་རོ། །
en: They will abide by compassion.

source: དགའ་བ་ལ་གནས་པར་ཡང་འགྱུར་རོ། །
en: They will abide by joy.

source: བཏང་སྙོམས་ལ་གནས་པར་ཡང་འགྱུར་རོ། །
en: They will abide by equanimity.

source: སྟོང་པའི་ཆོས་རྣམས་ལ་སྟོང་པར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will proclaim the emptiness of all empty phenomena.

source: སྟོང་པ་མ་ཡིན་པའི་ཆོས་རྣམས་ལ་སྟོང་པ་མ་ཡིན་པར་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will proclaim the nonemptiness of all nonempty phenomena.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་དོན་རྟགས་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will proclaim the meaning and the reasoning behind the Buddha’s teachings.

source: སངས་རྒྱས་ཀྱི་དེ་ཁོ་ནའི་ཆོས་ཀྱི་ལྟ་བ་སྨྲ་བར་ཡང་འགྱུར་རོ། །
en: They will proclaim the view of the Buddha’s teachings on reality.

source: གཙང་བར་ཡང་འགྱུར་རོ། །
en: “They will become pure.

source: གཙང་མས་ཕྱུག་པར་ཡང་འགྱུར་རོ། །
en: They will become rich with purity.

source: ཡོན་ཏན་གྱིས་ཕྱུག་པར་ཡང་འགྱུར་རོ། །
en: They will become rich with awakened qualities.

source: ཚུལ་ཁྲིམས་ཀྱིས་ཕྱུག་པར་ཡང་འགྱུར་རོ། །
en: They will become rich with discipline.

source: ཆོས་ཀྱིས་ཕྱུག་པར་ཡང་འགྱུར་རོ། །
en: They will become rich with Dharma.

source: དབྲོག་ཏུ་མེད་པའི་རྫས་ཀྱིས་ཕྱུག་པར་ཡང་འགྱུར་རོ། །
en: They will become rich with goods that were not obtained by stealing.

source: སྐྱེ་བོ་དབུལ་པོ་སློང་བ་ལ་སོགས་པ་ལ་གཏེར་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like a treasury for all poor beings and beggars.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་རྣམས་སྟོན་པ་ན་མི་སྐྲག་མི་དངང་ཞིང་དངང་བར་ཡང་མི་འགྱུར་རོ། །
en: They will not become fearful or apprehensive and will never panic when it is taught that all phenomena are empty, signless, and wishless.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དུ་སྐྱེ་བར་བྱ་བར་སེམས་བསྐྱེད་པ་དེ་དང་དེར་སྐྱེ་བར་ཡང་འགྱུར་རོ། །
en: They will attain birth in whichever buddhafield they aspire to be born into.

source: རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་དོན་དུ་མི་གཉེར་བར་ཡང་འགྱུར་རོ། །
en: They will not seek after gain, respect, and praise.

source: ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་བསྡུས་ནས་དམ་པའི་ཆོས་ལ་དགོད་པར་ཡང་འགྱུར་རོ། །
en: “They will gather all those with lax discipline and establish them within the sacred Dharma.

source: ཚུལ་ཁྲིམས་འཆལ་པ་གཡོ་སྒྱུ་དང་ལྡན་པ་རྣམས་ལ་ཐོག་ཏོག་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will become like a hailstorm among all those who possess lax discipline and devious minds.

source: དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་མི་གཟོ་བ་རྣམས་བྱས་པ་གཟོ་བ་ལ་ཡང་དག་པར་སྦྱོར་བར་ཡང་འགྱུར་རོ། །
en: They will cause all those who do not appreciate the Tathāgata’s kindness to develop proper appreciation.

source: མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་དུ་མི་འཕྲོགས་པར་ཡང་འགྱུར་ཞིང་སླར་དེ་ལ་ཐབས་དང་ལྡན་པར་ཡང་འགྱུར་རོ། །
en: They will become unassailable within the abodes of the non-Buddhist schools and, moreover, will treat them with skillful means.

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། མུ་སྟེགས་ཅན་ཕས་ཀྱི་རྒོལ་བ་མང་པོ་དག་གིས་ཕུག་རྡུགས་སུ་མི་ཆུད་ཅིང་སླར་དེ་ལ་ཐབས་ཀྱིས་རྟོན་པར་ཡང་འགྱུར་རོ། །
en: They will not allow themselves to be dug into a hole by the many arguments of ascetics, brahmins, and non-Buddhists and, moreover, will rely on skillful means when dealing with them.

source: མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་ཀྱི་གསང་ཚིག་རྣམས་ལ་འདུན་པར་མི་འགྱུར་ཞིང་སླར་དེ་ལ་ཐབས་ཀྱིས་འདུན་པར་བྱེད་པར་ཡང་འགྱུར་རོ། །
en: They will not take interest in the esoteric teachings of all the non-Buddhist sects and, moreover, will arouse their interest through skillful means.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟའི་གནས་ཐམས་ཅད་ལ་རྟེན་པར་མི་འགྱུར་ཞིང་སླར་དེ་ལ་ཐབས་ཀྱིས་ཡང་དག་པར་རྟེན་པ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will not dwell in the abodes of the gods, nāgas, yakṣas, or gandharvas and, moreover, will truly support them with skillful means.

source: ལས་ལ་རྟོན་པར་འགྱུར་གྱི་བཀྲ་ཤིས་དང་། དགེ་མཚན་ལ་རྟོན་པར་ཡང་མི་འགྱུར་རོ། །
en: “They will not rely upon auspicious and propitious signs, which are karmically conditioned.

source: སྲོག་གཅོད་པ་བྱེད་ཀྱང་སྲོག་གཅོད་པ་སྤངས་པར་ཡང་འགྱུར་རོ། །
en: They will engage in taking life while abandoning taking life.

source: མེ་ཏོག་ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མས་གདབ་པ་དང་། ཁྱིམ་པའི་ལོངས་སྤྱོད་ཡོངས་སུ་སྤྱད་པ་རྣམ་པ་དུ་མ་དག་དང་། ཆུང་མ་དང་ལྷན་ཅིག་ཏུ་འདོད་པའི་ཡོན་ཏན་སྤྱོད་ཀྱང་ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར་རོ། །
en: They will simultaneously engage in all sensual pleasures—flower garlands, fragrances, lotions, powders, the enjoyments of householders, various types of servants, and spouses—while maintaining the purest conduct.

source: སྲོག་གཅོད་པ་དང་། རྐུ་འཕྲོག་བྱེད་པ་དང་། བརྫུན་ཚིག་དང་། ཆང་འཐུང་བ་ལ་སོགས་པ་ལ་རྟེན་ཅིང་ལས་རྣམས་བྱེད་ལ། བུ་དང་ཆུང་མ་རྣམས་སྟོན་ཀྱང་ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར་རོ། །
en: They will engage in all such activities as killing, stealing, lying, hankering after drink, and so forth, and they will keep company with spouses and children, all while maintaining the purest conduct.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པར་ཡང་འགྱུར་རོ། །
en: They will receive offerings from all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རྗེད་པར་ཡང་འགྱུར་རོ། །
en: They will be honored by all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཆེར་བཀུར་བར་ཡང་འགྱུར་རོ། །
en: They will be well respected by all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་སྡུག་པར་བྱ་བའི་སྲས་སུ་ཡང་འགྱུར་རོ། །
en: They will become beloved children of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བྱས་པ་གཟོ་བའི་བགོ་སྐལ་ལ་སྤྱོད་པར་ཡང་འགྱུར་རོ། །
en: They will engage in proper appreciation of all the tathāgatas’ kindness.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕྲིན་ལས་མཚུངས་པའི་ཆོས་ཀྱི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will see the reality of phenomena, which is equivalent to the activity of all the tathāgatas.

source: སངས་རྒྱས་ཐམས་ཅད་དང་ཡེ་ཤེས་ཀྱི་ཡང་དག་པར་རྟོག་པ་མཚུངས་པར་ཡང་འགྱུར་རོ། །
en: “They will attain the authentic understanding of gnosis that is the same as that of all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་གསང་བ་རྣམ་པ་མང་པོ་ལུང་བསྟན་པའི་ཡུལ་ལ་སྤྱིས་བཙན་པའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: They will become crowned as rulers of the land of authoritative explanations of the manifold secret aspects of all the buddhas’ teachings.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསང་བའི་ཆོས་སྟོན་པ་རྣམ་པ་དུ་མ་བརྗོད་པར་ཡང་འགྱུར་རོ། །
en: They will express the manifold aspects of the secret Dharma teachings of all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བཞེད་པའི་ང་རྒྱལ་ལ་གནས་པའི་ཡུལ་ལ་གནས་པར་མཁས་པར་ཡང་འགྱུར་རོ། །
en: They will become skilled at abiding in the state of pride accepted by all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་མེད་པ་དང་། དྲི་མ་མེད་པ་དང་། བདག་དང་། སེམས་ཅན་མེད་པ། གསོ་བ་མེད་པ་དང་། འཇིགས་པ་མེད་པ་གསང་བ་རྣམ་པ་མང་པོའི་ཆོས་སྟོན་པའི་རང་བཞིན་དག་ལ་རིན་པོ་ཆེ་ལྟ་བུར་ཡང་འགྱུར་རོ། །
en: They will attain the jewel-like pure nature of the Dharma teachings of all the buddhas, with their manifold secret aspects—desirelessness, stainlessness, the absence of self, beings, and persons, and fearlessness.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་འདུལ་བའི་དབང་གིས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པའི་ཆོས་ཀྱི་ཕྱོགས་ཐམས་ཅད་ལ་འཇུག་པ་ཡང་དག་པར་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: “Through the power by which all the buddhas tame sentient beings, they will correctly see and engage in all phenomena such as desire, anger, ignorance, and fear.

source: སངས་རྒྱས་ཐམས་ཅད་ཡུན་རིང་པོ་བསྐལ་པ་བྱེ་བ་བགྲངས་པ་མང་པོ་ནས་རྒལ་ནས་ཉོན་མོངས་པའི་རྒྱ་མཚོ་ལས་གྲོལ་བར་མཛད་པའི་གསང་བ་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will see the reality of all secrets through which all the buddhas have attained liberation from the ocean of afflictions after passing through many millions of long eons.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་འདུལ་བའི་དབང་གིས་ཉོན་མོངས་པའི་རྒྱ་མཚོར་སྐྱེ་བ་བསྟན་ཏེ་
en: Through the power by which all the buddhas tame sentient beings, they will manifest birth within the ocean of suffering, and, thinking,

source: རྒལ་ནས་བསྒྲལ་བར་བྱའོ། །གྲོལ་ནས་དགྲོལ་བར་བྱའོ་སྙམ་ནས་བསྟན་པའི་གསང་བའི་ཁྱད་པར་གྱི་སྒོའི་རང་བཞིན་དག་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: ‘Having crossed over, I will attain liberation; having attained liberation, I will liberate others,’ they will see the pure nature of the special secret gateways that have been taught.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུན་རིང་པོ་བསྐལ་པ་བྱེ་བ་བགྲངས་པ་མང་པོ་འདས་པ་ནས་བདུད་བྱེ་བ་རབ་ཏུ་བཅོམ་པའི་རྣམ་པ་གསང་བའི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will see the reality of the secret ways in which all the buddhas, after passing beyond many millions of long eons, utterly defeat millions of māras.
